//
//  Post .swift
//  Task 11
//
//  Created by Maxim Dmytruk on 23.01.2023.
//

import UIKit

struct Post {
    
    var userName:String = "Some Interesting Channel"
    var userAvatarImageName = UIImage.init(named: "earth")
    var postImageName: String
    var viewsCount: Int
    var description: String
    var countOfComments: Int
    var postedAt: Int
    
}


struct DataBase {

    static var descriptionsArray = ["Дрифт — техніка проходження поворотів і вид   автоспорту, що характеризуються                                 проходженням поворотів з навмисним зривом провідної осі і прохід у керованому заносі на максимально можливій для утримання на трасі кута швидкості",
                                    "Брейкінг (англ. Breaking) — стиль вуличного танцю, що з'явився в Південному Бронксі (Нью-Йорк), на початку 70-х років. Цей танець є одною з частин хіп-хоп культури, тому один з найстаріших і найвідоміших стилів хіп-хоп танців.",
                                    "Бокс — контактный вид спорта, единоборство, в котором спортсмены наносят друг другу удары кулаками обычно в специальных перчатках. ",
                                    "Баскетбо́л — спортивна командна гра з м'ячем, який закидають руками в кільце із сіткою (кошик), закріпленою на щиті на висоті 3 метри 5 сантиметрів (10 футів) над майданчиком.",
                                    "Змішані бойові мистецтва — вид спорту і категорія бойових мистецтв, що включає в себе різноманітні засоби і способи ведення оборони й нападу в рукопашному бою."]
    
    static var imageArray = ["drift","breaking","boxing","basket","mma"]
    
}
